HRMREDChuklinTest.ZUPC/src/Reports/ZUPC_ОтчетПоРабочиМестам/ZUPC_ОтчетПоРабочиМестам.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Report>
  <name>ZUPC_ОтчетПоРабочиМестам</name>
</mdclass:Report>

HRMREDChuklinTest.ZUPC/src/InformationRegisters/ZUPC_ИсторияStaffAccomodation/ZUPC_ИсторияStaffAccomodation.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ZUPC_ИсторияStaffAccomodation</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>Офис</name>
    <type>
      <types>CatalogRef.ZUPC_Офисы</types>
    </type>
  </resources>
  <resources>
    <name>НомерМеста</name>
    <type>
      <types>CatalogRef.ZUPC_НомерМеста</types>
    </type>
  </resources>
  <resources>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>ФизическоеЛицо</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

HRMREDChuklinTest.ZUPC/src/Reports/ZUPC_ОтчетПоРабочиМестам/Forms/ФормаОтчета/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ЗаполнитьСписокВыбораРежимаОтбора();
	Если ПустаяСтрока(РежимОтбораМест) Тогда
		РежимОтбораМест = "Все места";
	КонецЕсли;
	ЗаполнитьРабочиеМестаНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ОбновитьОтображениеКартыОфиса();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура КомментарийПриИзменении(Элемент)
	ТекущиеДанные = Элементы.РабочиеМеста.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	Если ТекущиеДанные.ЭтоГруппа Тогда
		Возврат;
	КонецЕсли;
	Если Не СохранитьКомментарийНаСервере(ТекущиеДанные.Период, ТекущиеДанные.ФизическоеЛицо, ТекущиеДанные.Комментарий) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Комментарий можно сохранить только для рабочего места с записью истории размещения.");
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура РежимОтбораМестПриИзменении(Элемент)
	ЗаполнитьРабочиеМестаНаСервере();
	СтандартныеПодсистемыКлиент.РазвернутьУзлыДерева(ЭтотОбъект, "РабочиеМеста");
КонецПроцедуры

&НаКлиенте
Процедура ОтборРабочихМестПриИзменении(Элемент)
	ЗаполнитьРабочиеМестаНаСервере();
	СтандартныеПодсистемыКлиент.РазвернутьУзлыДерева(ЭтотОбъект, "РабочиеМеста");
	ОбновитьОтображениеКартыОфиса();
КонецПроцедуры

&НаКлиенте
Процедура ПоказыватьМестаРассадкиПриИзменении(Элемент)
	ОбновитьОтображениеКартыОфиса();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗаполнитьСписокВыбораРежимаОтбора()
	Элементы.РежимОтбораМест.СписокВыбора.Очистить();
	Элементы.РежимОтбораМест.СписокВыбора.Добавить("Все места");
	Элементы.РежимОтбораМест.СписокВыбора.Добавить("Только пустые места");
	Элементы.РежимОтбораМест.СписокВыбора.Добавить("Только заполненные места");
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьОтображениеКартыОфиса()
	ПоказыватьКартуОфиса = ПоказыватьМестаРассадки И ЗначениеЗаполнено(ОтборОфис);
	Элементы.ГруппаКартаОфиса.Видимость = ПоказыватьКартуОфиса;
	Если ПоказыватьКартуОфиса Тогда
		СсылкаНаКартуОфиса = ПолучитьНавигационнуюСсылку(ОтборОфис, "КартаОфиса");
	Иначе
		СсылкаНаКартуОфиса = "";
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьРабочиеМестаНаСервере()
	РабочиеМеста.ПолучитьЭлементы().Очистить();
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ZUPC_НомерМеста.Владелец КАК Офис,
		|	ZUPC_НомерМеста.Ссылка КАК НомерМеста,
		|	ЕСТЬNULL(
		|		ZUPC_ИсторияStaffAccomodationСрезПоследних.ФизическоеЛицо,
		|		ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)) КАК ФизическоеЛицо,
		|	ZUPC_ИсторияStaffAccomodationСрезПоследних.Период КАК Период,
		|	ZUPC_ИсторияStaffAccomodationСрезПоследних.Комментарий КАК Комментарий
		|ИЗ
		|	Справочник.ZUPC_НомерМеста КАК ZUPC_НомерМеста
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ZUPC_ИсторияStaffAccomodation.СрезПоследних(&ПериодСреза) КАК ZUPC_ИсторияStaffAccomodationСрезПоследних
		|		ПО ZUPC_НомерМеста.Ссылка = ZUPC_ИсторияStaffAccomodationСрезПоследних.НомерМеста
		|			И ZUPC_НомерМеста.Владелец = ZUPC_ИсторияStaffAccomodationСрезПоследних.Офис
		|			";
	ЕстьУсловияОтбора = Ложь;
	Если ЗначениеЗаполнено(ОтборОфис) Тогда
		ДобавитьУсловиеОтбора(Запрос, "ZUPC_НомерМеста.Владелец = &ОтборОфис", ЕстьУсловияОтбора);
		Запрос.УстановитьПараметр("ОтборОфис", ОтборОфис);
	КонецЕсли;
	Если ЗначениеЗаполнено(ОтборНомерМеста) Тогда
		ДобавитьУсловиеОтбора(Запрос, "ZUPC_НомерМеста.Ссылка = &ОтборНомерМеста", ЕстьУсловияОтбора);
		Запрос.УстановитьПараметр("ОтборНомерМеста", ОтборНомерМеста);
	КонецЕсли;
	Если ЗначениеЗаполнено(ОтборФизическоеЛицо) Тогда
		ДобавитьУсловиеОтбора(
			Запрос,
			"ZUPC_ИсторияStaffAccomodationСрезПоследних.ФизическоеЛицо = &ОтборФизическоеЛицо",
			ЕстьУсловияОтбора);
		Запрос.УстановитьПараметр("ОтборФизическоеЛицо", ОтборФизическоеЛицо);
	КонецЕсли;
	Запрос.Текст = СтрШаблон(
		"%1
		|
		|УПОРЯДОЧИТЬ ПО
		|	Офис,
		|	НомерМеста",
		Запрос.Текст);
	Запрос.УстановитьПараметр("ПериодСреза", ТекущаяДатаСеанса());
	Выборка = Запрос.Выполнить().Выбрать();
	СтрокиОфисов = Новый Соответствие;
	Пока Выборка.Следующий() Цикл
		ПустоеМесто = Не ЗначениеЗаполнено(Выборка.ФизическоеЛицо);
		Если РежимОтбораМест = "Только пустые места" И Не ПустоеМесто Тогда
			Продолжить;
		КонецЕсли;
		Если РежимОтбораМест = "Только заполненные места" И ПустоеМесто Тогда
			Продолжить;
		КонецЕсли;
		СтрокаОфиса = СтрокиОфисов.Получить(Выборка.Офис);
		Если СтрокаОфиса = Неопределено Тогда
			СтрокаОфиса = РабочиеМеста.ПолучитьЭлементы().Добавить();
			СтрокаОфиса.Офис = Выборка.Офис;
			СтрокаОфиса.ЭтоГруппа = Истина;
			СтрокаОфиса.ПустоеМесто = Ложь;
			СтрокиОфисов.Вставить(Выборка.Офис, СтрокаОфиса);
		КонецЕсли;
		НоваяСтрока = СтрокаОфиса.ПолучитьЭлементы().Добавить();
		НоваяСтрока.Офис = Выборка.Офис;
		НоваяСтрока.НомерМеста = Выборка.НомерМеста;
		НоваяСтрока.ФизическоеЛицо = Выборка.ФизическоеЛицо;
		НоваяСтрока.Период = Выборка.Период;
		НоваяСтрока.Комментарий = Выборка.Комментарий;
		НоваяСтрока.ЭтоГруппа = Ложь;
		НоваяСтрока.ПустоеМесто = ПустоеМесто;
	КонецЦикла;
КонецПроцедуры

&НаСервере
Процедура ДобавитьУсловиеОтбора(Запрос, Знач УсловиеОтбора, ЕстьУсловияОтбора)
	Если ЕстьУсловияОтбора Тогда
		Запрос.Текст = СтрШаблон(
			"%1
			|	И %2",
			Запрос.Текст,
			УсловиеОтбора);
	Иначе
		Запрос.Текст = СтрШаблон(
			"%1
			|
			|ГДЕ
			|	%2",
			Запрос.Текст,
			УсловиеОтбора);
		ЕстьУсловияОтбора = Истина;
	КонецЕсли;
КонецПроцедуры

&НаСервереБезКонтекста
Функция СохранитьКомментарийНаСервере(Знач Период, Знач ФизическоеЛицо, Знач Комментарий)
	Если Не ЗначениеЗаполнено(Период) Или Не ЗначениеЗаполнено(ФизическоеЛицо) Тогда
		Возврат Ложь;
	КонецЕсли;
	НаборЗаписей = РегистрыСведений.ZUPC_ИсторияStaffAccomodation.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Период.Установить(Период);
	НаборЗаписей.Отбор.ФизическоеЛицо.Установить(ФизическоеЛицо);
	НаборЗаписей.Прочитать();
	Если НаборЗаписей.Количество() = 0 Тогда
		Возврат Ложь;
	КонецЕсли;
	НаборЗаписей[0].Комментарий = Комментарий;
	НаборЗаписей.Записать(Истина);
	Возврат Истина;
КонецФункции

#КонецОбласти
